let data = 
{
    "1001":
        {
            "id":1001,
            "name":"水系星球",
            "intro":"星球由水、鱼和水草组成",
            "broke":
                [
                    [0, 65, 0, 144],
                    [-55, -45, 5, 432],
                    [55, -45, 10, 864],
                ],
            "game_meteor_income":100,
        },

    "1002":
        {
            "id":1002,
            "name":"时间星球",
            "intro":"由各种钟表、转动的齿轮组成",
            "broke":
                [
                    [0, 65, 15, 1440],
                    [-55, -45, 30, 2160],
                    [55, -45, 100, 3024],
                ],
            "game_meteor_income":100,
        },
    "1003":
        {
            "id":1003,
            "name":"游乐星球",
            "intro":"热气球、摩天轮、过山车等组成",
            "broke":
                [
                    [0, 65, 210, 4032],
                    [-55, -45, 360, 5184],
                    [55, -45, 770, 6480],
                ],
            "game_meteor_income":100,
        },
    "1004":
        {
            "id":1004,
            "name":"酷饮星球",
            "intro":"由啤酒、可乐等各类饮品组成",
            "broke":
                [
                    [0, 65, 910, 7920],
                    [-55, -45, 1050, 9504],
                    [55, -45, 1190, 11232],
                ],
            "game_meteor_income":100,
        },
    "1005":
        {
            "id":1005,
            "name":"魔法星球",
            "intro":"飞天扫帚、巫师帽、魔法棒组成",
            "broke":
                [
                    [0, 65, 1330, 13104],
                    [-55, -45, 1470, 15120],
                    [55, -45, 1610, 17280],
                ],
            "game_meteor_income":100,
        },
    "1006":
        {
            "id":1006,
            "name":"草系星球",
            "intro":"由树木、藤蔓等元素组成",
            "broke":
                [
                    [0, 65, 1750, 19584],
                    [-55, -45, 1890, 22032],
                    [55, -45, 2030, 24624],
                ],
            "game_meteor_income":100,
        },
    "1007":
        {
            "id":1007,
            "name":"机械之心",
            "intro":"由一些机械元素组成",
            "broke":
                [
                    [0, 65, 2170, 27360],
                    [-55, -45, 2310, 30240],
                    [55, -45, 2450, 33264],
                ],
            "game_meteor_income":100,
        },
    "1008":
        {
            "id":1008,
            "name":"冰雪世界",
            "intro":"由冰雪、冰川、小雪人组成",
            "broke":
                [
                    [0, 65, 2590, 36432],
                    [-55, -45, 2730, 36432],
                    [55, -45, 2870, 43200],
                ],
            "game_meteor_income":100,
        },
    "1009":
        {
            "id":1009,
            "name":"地中海城",
            "intro":"由海与城堡组成",
            "broke":
                [
                    [0, 65, 3010, 46800],
                    [-55, -45, 3150, 50544],
                    [55, -45, 3290, 54432],
                ],
            "game_meteor_income":100,
        },
    "1010":
        {
            "id":1010,
            "name":"香蕉船",
            "intro":"由黄色的香蕉与奶油组成",
            "broke":
                [
                    [0, 65, 3430, 58464],
                    [-55, -45, 3570, 62640],
                    [55, -45, 3710, 66960],
                ],
            "game_meteor_income":100,
        },
    "1011":
        {
            "id":1011,
            "name":"霓虹派对",
            "intro":"由一些霓虹元素组成",
            "broke":
            [
                [0, 65, 3850, 71424],
                [-55, -45, 3990, 76032],
                [55, -45, 4130, 80784],
            ],
            "game_meteor_income":100,
        },
    "1012":
        {
            "id":1012,
            "name":"电路之城",
            "intro":"由电池与线路组成",
            "broke":
            [
                [0, 65, 4270, 85680],
                [-55, -45, 4410, 90720],
                [55, -45, 4550, 95904],
            ],
            "game_meteor_income":100,
        },

    "1013":
        {
            "id":1013,
            "name":"漂浮图书馆",
            "intro":"由书册与书架组成",
            "broke":
            [
                [0, 65, 4690, 101232],
                [-55, -45, 4830, 106704],
                [55, -45, 4970, 112320],
            ],
            "game_meteor_income":100,
        },

    "1014":
        {
            "id":1014,
            "name":"小丑马戏团",
            "intro":"以小丑元素组合成",
            "broke":
            [
                [0, 65, 5110, 118080],
                [-55, -45, 5250, 123984],
                [55, -45, 5390, 130032],
            ],
            "game_meteor_income":100,
        },

    "1015":
        {
            "id":1015,
            "name":"欢乐泳池",
            "intro":"由池水、游泳圈、水上玩具组成",
            "broke":
            [
                [0, 65, 5530, 136224],
                [-55, -45, 5670, 142560],
                [55, -45, 5810, 149040],
            ],
            "game_meteor_income":100,
        },

    "1016":
        {
            "id":1016,
            "name":"微风沙漠",
            "intro":"由沙漠及沙漠中仙人掌植物组成",
            "broke":
            [
                [0, 65, 5950, 155664],
                [-55, -45, 6090, 162432],
                [55, -45, 6230, 169344],
            ],
            "game_meteor_income":100,
        },

    "1017":
        {
            "id":1017,
            "name":"罗马竞技场",
            "intro":"由竞技场建筑组成整个星球",
            "broke":
            [
                [0, 65, 6370, 176400],
                [-55, -45, 6510, 183600],
                [55, -45, 6650, 190944],
            ],
            "game_meteor_income":100,
        },

    "1018":
        {
            "id":1018,
            "name":"无尽赛道",
            "intro":"由赛道、障碍等物组成",
            "broke":
            [
                [0, 65, 6790, 198432],
                [-55, -45, 6930, 206064],
                [55, -45, 7070, 213840],
            ],
            "game_meteor_income":100,
        },

    "1019":
        {
            "id":1019,
            "name":"樱花神社",
            "intro":"由樱花、小木桥等组成",
            "broke":
            [
                [0, 65, 7210, 221760],
                [-55, -45, 7350, 229824],
                [55, -45, 7490, 238032],
            ],
            "game_meteor_income":100,
        },

    "1020":
        {
            "id":1020,
            "name":"提琴山谷",
            "intro":"由提琴、音符组成",
            "broke":
            [
                [0, 65, 7630, 246384],
                [-55, -45, 7770, 254880],
                [55, -45, 7910, 263520],
            ],
            "game_meteor_income":100,
        },

    "1021":
        {
            "id":1021,
            "name":"泡泡糖",
            "intro":"由各色泡泡糖组成",
            "broke":
            [
                [0, 65, 8050, 272304],
                [-55, -45, 8190, 281232],
                [55, -45, 8330, 290304],
            ],
            "game_meteor_income":100,
        },

    "1022":
        {
            "id":1022,
            "name":"花朵庄园",
            "intro":"由各类花朵组成",
            "broke":
            [
                [0, 65, 8470, 299520],
                [-55, -45, 8610, 308880],
                [55, -45, 8750, 318384],
            ],
            "game_meteor_income":100,
        },

    "1023":
        {
            "id":1023,
            "name":"火山熔岩",
            "intro":"由火山、岩浆组成",
            "broke":
            [
                [0, 65, 8890, 328032],
                [-55, -45, 9030, 337824],
                [55, -45, 9170, 347760],
            ],
            "game_meteor_income":100,
        },


    "1024":
        {
            "id":1024,
            "name":"七彩水晶",
            "intro":"由各色水晶组成",
            "broke":
            [
                [0, 65, 9310, 357840],
                [-55, -45, 9450, 368064],
                [55, -45, 9590, 378432],
            ],
            "game_meteor_income":100,
        },

    "1025":
        {
            "id":1025,
            "name":"糖果甜心",
            "intro":"由一个巨大的糖果作为整个星球",
            "broke":
            [
                [0, 65, 9730, 388944],
                [-55, -45, 9870, 399600],
                [55, -45, 10010, 410400],
            ],
            "game_meteor_income":100,
        },

    "1026":
        {
            "id":1026,
            "name":"平静草原",
            "intro":"由草原、河流组成",
            "broke":
            [
                [0, 65, 10150, 421344],
                [-55, -45, 10290, 432432],
                [55, -45, 10430, 443664],
            ],
            "game_meteor_income":100,
        },

    "1027":
        {
            "id":1027,
            "name":"月影湖泊",
            "intro":"以湖泊为星球，湖泊中倒影着月亮",
            "broke":
            [
                [0, 65, 10570, 455040],
                [-55, -45, 10710, 466560],
                [55, -45, 10850, 478224],
            ],
            "game_meteor_income":100,
        },

    "1028":
        {
            "id":1028,
            "name":"宁静之河",
            "intro":"以夜晚的河流、萤火虫、水草做成",
            "broke":
            [
                [0, 65, 10990, 490032],
                [-55, -45, 11130, 501984],
                [55, -45, 11270, 514080],
            ],
            "game_meteor_income":100,
        },

    "1029":
        {
            "id":1029,
            "name":"暴躁河豚",
            "intro":"以巨大的可爱风的河豚为星球",
            "broke":
            [
                [0, 65, 11410, 526320],
                [-55, -45, 11550, 538704],
                [55, -45, 11690, 551232],
            ],
            "game_meteor_income":100,
        },

    "1030":
        {
            "id":1030,
            "name":"椰子山谷",
            "intro":"以椰子为星球",
            "broke":
            [
                [0, 65, 11830, 563904],
                [-55, -45, 11970, 576720],
                [55, -45, 12110, 589680],
            ],
            "game_meteor_income":100,
        }
}

let star_base_data =
{
    "affair_reward":500,
    "affair_rob":1200,
}

export default class StarConfig{
    static GetStarIds(){
        var ids = [];
        for(var id in data){
            ids.push(id);
        }
        return ids;
    }

    static GetStarConfig(id){
        return data[id.toString()];
    }

    static IsMaxStarId(id){
        return 1030 == parseInt(id);
    }

    static GetStarBrokeList(id){
        return data[id.toString()]["broke"]
    }

    static GetMazeCellCost(id, broke){
        return this.GetStarBrokeList(id)[broke][3]
    }

    static GetBaseAffairReward(){
        return star_base_data["affair_reward"]
    }

    static GetBaseAffairRob(){
        return star_base_data["affair_rob"]
    }

    static GetGameMeteorIncome(id){
        return data[id.toString()]["game_meteor_income"]
    }
}